{
  "backend/main.mo": "Empty Motoko actor serving as the backend entry point with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report confirming the engagement rate display value was updated to 5.2% in siteContent.ts, with high confidence and linked to test REQ-1.",
  "frontend-file-summaries.txt": "JSON document summarizing each frontend source file's purpose and key changes, serving as a build/documentation reference for the project.",
  "frontend/.env.production.example": "Example production environment file defining VITE_PUBLIC_URL for use in Open Graph metadata, Twitter Cards, canonical links, and share URLs.",
  "frontend/index.css": "Root CSS file defining OKLCH-based design tokens for light and dark themes including colors, borders, charts, and sidebar variables via Tailwind base layer.",
  "frontend/index.html": "HTML entry point with SEO metadata, Open Graph and Twitter Card tags, canonical URL, and Inter font preconnect all configured for the bubbas.big.adventure.com domain.",
  "frontend/PUBLIC_URL.md": "Documentation explaining that the canonical public URL (https://bubbas.big.adventure.com) is defined as a single source of truth in publicUrl.ts.",
  "frontend/src/App.tsx": "Root React component that renders the appropriate section based on the active URL hash tab and wraps content in a view mode class for responsive preview constraints.",
  "frontend/src/components/site/Footer.tsx": "Footer component displaying brand name, Instagram and Facebook social links, copyright, and a Caffeine.ai attribution link with UTM tracking.",
  "frontend/src/components/site/portfolio/DriveVideoEmbed.tsx": "Inline iframe component for embedding Google Drive videos with loading, error, and hover-triggered expand-button states.",
  "frontend/src/components/site/portfolio/PortfolioItemCard.tsx": "Card component that renders a 9:16 video embed via DriveVideoEmbed and opens a full-screen PortfolioVideoOverlay when the expand button is clicked.",
  "frontend/src/components/site/portfolio/PortfolioVideoOverlay.tsx": "A fullscreen video overlay modal component that embeds a video via iframe, locks body scroll, closes on Escape key or backdrop click, and optionally displays a description.",
  "frontend/src/components/site/sections/AboutSection.tsx": "Renders the About section with a profile photo, bio paragraphs, and a grid of past brand collaborations sourced from siteContent.",
  "frontend/src/components/site/sections/ContactSection.tsx": "Renders the Contact section displaying email, Instagram, and location info with mailto and external links, sourced from siteContent.",
  "frontend/src/components/site/sections/HeroSection.tsx": "Full-screen hero section with headline, subhead, and two CTA buttons that navigate to the media-kit and contact tabs using a custom hook.",
  "frontend/src/components/site/sections/MediaKitSection.tsx": "Displays a structured media kit with quick stats, audience demographics, platforms, services summary, and noteworthy projects sourced from siteContent.",
  "frontend/src/components/site/sections/PortfolioSection.tsx": "Renders the Portfolio section by iterating over content categories and displaying each item using PortfolioItemCard in a responsive grid.",
  "frontend/src/components/site/sections/PricingSection.tsx": "Displays influencer and UGC pricing packages with line items, add-ons, notes, and a custom footer note, all sourced from siteContent.",
  "frontend/src/components/site/sections/SectionShell.tsx": "A reusable section wrapper component that renders a titled, subtitled section with consistent padding, a separator, and a container for child content.",
  "frontend/src/components/site/SiteNav.tsx": "Fixed navigation bar with desktop and mobile (Sheet) layouts, tab-based routing, scroll-aware styling, and an embedded ViewModeControl; Portfolio is the last nav item.",
  "frontend/src/components/site/ViewModeControl.tsx": "Dropdown select component allowing users to switch between Auto, Mobile, and Desktop view modes, each represented with an icon and label.",
  "frontend/src/config/publicUrl.ts": "Exports the canonical public URL for the app, defaulting to the production domain and allowing override via the VITE_PUBLIC_URL environment variable.",
  "frontend/src/content/siteContent.ts": "Central content configuration object containing all static text, stats, portfolio items, pricing, and contact info used across the site's sections.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing ICP Internet Identity authentication state, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useTabNavigation.ts": "Hook that manages tab navigation state using the URL hash, supporting a fixed set of allowed tab IDs and syncing state with hash changes.",
  "frontend/src/hooks/useViewMode.ts": "Hook that persists and applies a view mode ('auto', 'mobile', or 'desktop') to localStorage and the document root's data attribute.",
  "frontend/src/index.css": "Global CSS file defining Tailwind base/components/utilities, OKLCH-based CSS custom properties for a sage-green/tan design system with light and dark themes, and view mode layout constraints.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/utils/googleDrive.ts": "Utility functions for extracting Google Drive file IDs from various URL formats and generating preview, direct, and embed URLs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with OKLCH color tokens (sage, tan, chart colors), custom border radii, box shadows, accordion animations, and typography/container-queries/animate plugins.",
  "project_state.json": "Project state metadata file tracking schema version, existing features, and the current task of updating the media kit engagement rate display value to 5.2%."
}