{
  "backend/main.mo": "Minimal Motoko actor with no methods or logic.",
  "feature_evidence.json": "Feature evidence report listing implemented features, associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Aggregated summaries describing the purpose of all major frontend files and components.",
  "frontend/.env.production.example": "Example production environment file defining the required VITE_PUBLIC_URL domain for builds.",
  "frontend/index.css": "Global Tailwind CSS setup defining OKLCH color tokens, theme variables, and dark mode overrides.",
  "frontend/index.html": "Main HTML template with metadata, canonical URL, and Open Graph/Twitter tags pointing to the production domain.",
  "frontend/PUBLIC_URL.md": "Documentation explaining the canonical public URL configuration and its role as the source of truth.",
  "frontend/src/App.tsx": "Root React component that renders sections based on active navigation tab and applies view‑mode layout handling.",
  "frontend/src/components/site/Footer.tsx": "Footer with fixed Facebook share URL, Instagram link, branding, and dynamic year/attribution.",
  "frontend/src/components/site/portfolio/DriveVideoEmbed.tsx": "Embeds a Google Drive video with loading, error, and expand-overlay states using an iframe.",
  "frontend/src/components/site/portfolio/PortfolioItemCard.tsx": "Renders a portfolio item card and opens a fullscreen video overlay for video items.",
  "frontend/src/components/site/portfolio/PortfolioVideoOverlay.tsx": "Displays a fullscreen video overlay with scroll lock, escape-to-close, and an embedded iframe player.",
  "frontend/src/components/site/sections/AboutSection.tsx": "Shows the About section with a photo, descriptive paragraphs, and a grid of past collaborations.",
  "frontend/src/components/site/sections/ContactSection.tsx": "Provides contact options including email, Instagram, and location within a styled section.",
  "frontend/src/components/site/sections/HeroSection.tsx": "Renders the hero banner with headline text and buttons for navigating to media kit or contact sections.",
  "frontend/src/components/site/sections/MediaKitSection.tsx": "Displays media kit details including stats, demographics, platforms, services, and notable projects.",
  "frontend/src/components/site/sections/PortfolioSection.tsx": "Lists portfolio categories and renders each item's card using PortfolioItemCard.",
  "frontend/src/components/site/sections/PricingSection.tsx": "Shows pricing for influencer and UGC content with items, add‑ons, and a custom note.",
  "frontend/src/components/site/sections/SectionShell.tsx": "Provides a reusable layout wrapper for site sections with title, subtitle, and optional styling.",
  "frontend/src/components/site/SiteNav.tsx": "Responsive navigation bar with tab routing, scroll behavior, mobile sheet menu, and view mode selector.",
  "frontend/src/components/site/ViewModeControl.tsx": "Selector component allowing users to switch between auto, mobile, and desktop preview modes.",
  "frontend/src/config/publicUrl.ts": "Defines the app’s canonical PUBLIC_URL with optional override via environment variable.",
  "frontend/src/content/siteContent.ts": "Defines static site content including hero text, about info, media kit data, portfolio categories, and pricing placeholders.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor instance that updates when the Internet Identity changes and triggers related query invalidation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, handling login, logout, stored identity restoration, and AuthClient setup.",
  "frontend/src/hooks/useTabNavigation.ts": "Manages tab navigation based on URL hash changes and provides helpers to switch tabs.",
  "frontend/src/hooks/useViewMode.ts": "Stores and applies a persistent view mode (auto/mobile/desktop) via localStorage and document attributes.",
  "frontend/src/index.css": "Defines Tailwind base styles, custom color variables, utility classes, and view‑mode-specific layout rules.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClient and InternetIdentity providers.",
  "frontend/src/utils/googleDrive.ts": "Utility functions for extracting Google Drive file IDs and generating various embed and view URLs.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, color mappings to CSS variables, plugins, and container settings.",
  "project_state.json": "Tracks project state, existing features, pending requests, and metadata for deployment readiness."
}